
## :x: Apply Failed

[CI link](https://github.com/takahiro-impara/pd-iac/actions/runs/8227920889)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
pagerduty_team.pd_team["poc-k8s"]: Refreshing state... [id=P31QTVE]
pagerduty_team.pd_team["poc-pd"]: Refreshing state... [id=P6ABU84]
data.pagerduty_vendor.vendor: Reading...
pagerduty_team.pd_team["poc"]: Refreshing state... [id=PVFT88T]
pagerduty_user.pd_user["imparapoc03@gmail.com"]: Refreshing state... [id=POCJ4A2]
data.pagerduty_vendor.vendor: Read complete after 0s [id=PAM4FGS]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.pagerduty_users.pd_users["poc-pd-svc"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "pagerduty_users" "pd_users" {
      + id       = (known after apply)
      + team_ids = [
          + "P6ABU84",
        ]
      + users    = (known after apply)
    }

  # data.pagerduty_users.pd_users["poc-pk8s-svc"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "pagerduty_users" "pd_users" {
      + id       = (known after apply)
      + team_ids = [
          + "P31QTVE",
        ]
      + users    = (known after apply)
    }

  # pagerduty_escalation_policy.pd_esp["poc-pd-svc"] will be created
  + resource "pagerduty_escalation_policy" "pd_esp" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "escalation-policy-poc-pd-svc"
      + num_loops   = 3
      + teams       = [
          + "P6ABU84",
        ]

      + rule {
          + escalation_delay_in_minutes = 10
          + id                          = (known after apply)

          + target {
              + id   = (known after apply)
              + type = "user_reference"
            }
        }
    }

  # pagerduty_escalation_policy.pd_esp["poc-pk8s-svc"] will be created
  + resource "pagerduty_escalation_policy" "pd_esp" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "escalation-policy-poc-pk8s-svc"
      + num_loops   = 3
      + teams       = [
          + "P31QTVE",
        ]

      + rule {
          + escalation_delay_in_minutes = 10
          + id                          = (known after apply)

          + target {
              + id   = (known after apply)
              + type = "user_reference"
            }
        }
    }

  # pagerduty_service.pd_service["poc-pd-svc"] will be created
  + resource "pagerduty_service" "pd_service" {
      + acknowledgement_timeout = "1200"
      + alert_creation          = "create_alerts_and_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "86400"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "Poc-Pd-Svc"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + alert_grouping_parameters {
          + type = "intelligent"
        }

      + auto_pause_notifications_parameters {
          + enabled = true
          + timeout = 300
        }
    }

  # pagerduty_service.pd_service["poc-pk8s-svc"] will be created
  + resource "pagerduty_service" "pd_service" {
      + acknowledgement_timeout = "1200"
      + alert_creation          = "create_alerts_and_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "86400"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "Poc-Pk8s-Svc"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + alert_grouping_parameters {
          + type = "intelligent"
        }

      + auto_pause_notifications_parameters {
          + enabled = true
          + timeout = 300
        }
    }

  # pagerduty_service_integration.datadog["poc-pd-svc"] will be created
  + resource "pagerduty_service_integration" "datadog" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "datadog-integration-poc-pd-svc"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PAM4FGS"
    }

  # pagerduty_service_integration.datadog["poc-pk8s-svc"] will be created
  + resource "pagerduty_service_integration" "datadog" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "datadog-integration-poc-pk8s-svc"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PAM4FGS"
    }

  # pagerduty_team.pd_team["poc"] will be destroyed
  # (because key ["poc"] is not in for_each map)
  - resource "pagerduty_team" "pd_team" {
      - default_role = "manager" -> null
      - description  = "Managed by Terraform" -> null
      - html_url     = "https://fastretailing-staging.pagerduty.com/teams/PVFT88T" -> null
      - id           = "PVFT88T" -> null
      - name         = "poc" -> null
    }

  # module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc-k8s"] will be created
  + resource "pagerduty_team_membership" "team_membership" {
      + id      = (known after apply)
      + role    = "manager"
      + team_id = "P31QTVE"
      + user_id = "POCJ4A2"
    }

  # module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc-pd"] will be created
  + resource "pagerduty_team_membership" "team_membership" {
      + id      = (known after apply)
      + role    = "manager"
      + team_id = "P6ABU84"
      + user_id = "POCJ4A2"
    }

Plan: 8 to add, 0 to change, 1 to destroy.
pagerduty_team.pd_team["poc"]: Destroying... [id=PVFT88T]
╷
│ Error: DELETE API call to https://api.pagerduty.com/teams/PVFT88T failed 400 Bad Request. Code: 6006, Errors: [Cannot delete team with existing Schedules association(s)], Message: Team has existing associations
│ 
│ 
╵
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":9,"Program":"tfcmt","SHA1":"3444f43569004f3253cd2a653446d638d74e8910","Vars":{},"WorkflowName":"Apply Terraform"} -->